export const activitiesData = [
  {
    title: "দিবস উদযাপন",
    description:
      "(ক)	২১ ফেব্রুয়ারি শহীদ দিবস ও আন্তর্জাতিক মাতৃভাষা দিবস উপলক্ষে জাতীয় শহীদ মিনারে পুষ্পস্তবক অর্পণ। <br/> (খ)	১৭ মার্চ জাতির পিতা বঙ্গবন্ধু শেখ মুজিবুর রহমান এর জন্মবার্ষিকী উপলক্ষে তার প্রতিকৃতিতে শ্রদ্ধাঞ্জলি নিবেদন। <br/>(গ)	২৫ মার্চ সন্ধ্যায় রাজারবাগ টেলিকম অডিটরিয়ামে স্বাধীনতার প্রথম প্রহর উদযাপন। <br/>(ঘ)	২৬ মার্চ রাজারবাগ পুলিশ লাইনস্ স্মৃতিস্তম্ভে পুষ্পার্ঘ অর্পণ করে শ্রদ্ধা নিবেদন।<br/>(ঙ)	১৫ আগস্ট জাতির পিতা বঙ্গবন্ধু শেখ মুজিবর রহমানের প্রতিকৃতিতে পুষ্পার্ঘ অর্পণ করে শ্রদ্ধা নিবেদন।<br/>(চ)	১৫ আগস্ট জাতীয় শোক দিবস উপলক্ষে শোক সভার আয়োজন করা।<br/>(ছ)	১৬ ডিসেম্বর জাতীয় স্মৃতিসৌধ ও রাজারবাগ পুলিশ লাইনস্ স্মৃতিস্তম্ভে পুষ্পার্ঘ অর্পণ করে শ্রদ্ধা নিবেদন।",
  },
  {
    title: "আর্থিক সহায়তা ",
    description:
      "১.অ্যাসোসিয়েশনের সদস্য/পরিবারের সদস্যদের চিকিৎসার্থে আর্থিক সহায়তা প্রদান করা।  ",
  },
  {
    title: "সামাজিক কার্যক্রম ",
    description:
      "১.দুঃস্থ নাগরিকদের কথা বিবেচনায় রেখে তাদের মাঝে ঈদ বস্ত্র, শীত বস্ত্র বিতরণ করার ব্যবস্থা করা।<br/> ২.বন্যার্তদের সাহায্যার্থে ত্রাণ সামগ্রী বিতরণ। ৩.বিবিধ।",
  },
  {
    title: "প্রস্তাবিত কার্যক্রম ",
    description:
      "১.		অ্যাসোসিয়েশনের সদস্য ও পরিবারের জন্য কল্যাণমূলক কার্যক্রম গ্রহণ।<br/>২.		জনবল, লজিস্টিক্স সহ সাংগঠনিক কাঠামো বৃদ্ধির লক্ষ্যে প্রয়োজনীয় ব্যবস্থা গ্রহণ। <br/>৩.সাংস্কৃতিক অনুষ্ঠান আয়োজন ও প্রকাশনা সংক্রান্তে কার্যক্রম গ্রহণ। <br/>৪.		অ্যাসোসিয়েশনের সার্বিক কার্যক্রম ডিজিটালাইজেশন করণ।<br/> ৫.বাংলাদেশ পুলিশ সার্ভিস ফাউন্ডেশনের সার্বিক কার্যক্রম ত্বরান্তি করণ।",
  },
  {
    title: "সুভ্যেনির প্রকাশনা",
    description:
      "আন্ত:ক্যাডার সম্পর্ককে আরও সৌহার্দ্যপূর্ণ ও সুদৃঢ় করার লক্ষ্যে অন্যান্য ক্যাডারের কর্মকর্তাদের সাথে সমন্বয় সভা/প্রীতি সম্মেলন আয়োজন।",
  },
  {
    title: "অন্যান্য কার্যক্রম ",
    description:
      "১.		সুভ্যেনির প্রকাশনা। <br/>২.আন্ত:ক্যাডার সম্পর্ককে আরও সৌহার্দ্যপূর্ণ ও সুদৃঢ় করার লক্ষ্যে অন্যান্য ক্যাডারের কর্মকর্তাদের সাথে সমন্বয় সভা/প্রীতি সম্মেলন আয়োজন।<br/>৩.অ্যাসোসিয়েশনের স্বার্থ সংশ্লিষ্ট বিষয়ে বিভিন্ন মন্ত্রণালয়ের দায়িত্বে নিয়োজিত মাননীয় মন্ত্রী, সচিব এবং সরকারের নীতিনির্ধারণী ব্যক্তিবর্গের সাথে সৌজন্য সাক্ষাত করা ও স্বার্থ সংশ্লিষ্ট বিষয়ে আলোচনা করা।",
  },
];
