export const objectiveData = [
  {
    title:
      "বাংলাদেশ পুলিশ সার্ভিসের সদস্যগণের  শৃঙ্খলা, মনোবল, নৈতিকতা ও কর্মসন্তুষ্টির মান উন্নয়নসহ সর্বোচ্চ পেশাগত যোগ্যতা, দক্ষতা ও প্রাতিষ্ঠানিক সামর্থ্য বৃদ্ধির প্রয়াস চালানো।",
  },
  {
    title:
      "সমকালীন পুলিশি সেবার প্রয়োজনীয়তা বিবেচনায় রেখে পুলিশ সার্ভিসকে একটি আধুনিক, পেশাদারি ও জনমুখী প্রতিষ্ঠানে উত্তরণের প্রয়াস চালানো।",
  },
  {
    title:
      "অ্যাসোসিয়েশনের সকল সদস্য যাতে চাকরিগত ও পেশাগত সমস্যাবলি সমাধানের ব্যাপারে নিজস্ব চিন্তাধার বিনিময় করতে পারেন, সে বিষয়ে সুযোগ প্রদান। ",
  },
  {
    title:
      "অ্যাসোসিয়েশনের সদস্যদের কল্যাণে সমবায় সমিতি, পাঠাগার ও চিত্ত বিনোদনের জন্য ক্লাব ও প্রতিষ্ঠান পরিচালনা করা ও তহবিল গড়ে তোলা। ",
  },
  {
    title:
      "অ্যাসোসিয়েশনের সদস্য ও তাদের পরিবারবর্গের প্রয়োজনে যথাসাধ্য সহযোগিতা করা। ",
  },
  {
    title:
      "অন্যান্য সার্ভিসের অ্যাসোসিয়েশনগুলোর সাথে পারস্পরিক স্বার্থ সংশ্লিষ্ট বিষয়ে সহযোগিতা ও সম্বয় সাধন করা। ",
  },
];
